<a href="https://colab.research.google.com/github/vabeshiumich/CSC302_HW1/blob/main/HW1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Use pandas to read the olympic_medals.csv from the DATA folder on Google Drive. Then perform the followings by
using pandas and/or Python built-in functions

In [ ]:
import pandas as pd
medals = pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')

In [ ]:
#(a) Find the size of the data frame. How many rows, how many columns?
medals.shape

(2394, 8)

In [ ]:
#Use the appropriate function to report the data types for all columns.
medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2394 non-null   object
 1   Event        2394 non-null   object
 2   Location     2394 non-null   object
 3   Year         2394 non-null   int64
 4   Medal        2394 non-null   object
 5   Name         2164 non-null   object
 6   Nationality  2394 non-null   object
 7   Result       2351 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.8+ KB

In [ ]:
'''Find how many unique cities matches were held at. (Hint: unique( ). For instance, the following example tells
how many unique Events held:)
len(medals['Event'].unique())'''

len(medals['Location'].unique())

23

In [ ]:
#Find how many medals the USA team won in total.
medals[medals['Nationality']=='USA'].count()

Gender         638
Event          638
Location       638
Year           638
Medal          638
Name           577
Nationality    638
Result         624
dtype: int64

In [ ]:
#or
medalsUSA = medals[medals['Nationality']=='USA']
medalsUSA.shape

(638, 8)

In [ ]:
#Find the total number of medals for each Nationality
medals.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64